EDT/МПСтриж/src/InformationRegisters/МассивАдресовДляОбменаСМП/МассивАдресовДляОбменаСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МассивАдресовДляОбменаСМП</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/МПСтриж/src/InformationRegisters/ТранзакцииСБП/ТранзакцииСБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТранзакцииСБП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЭтапПроцессаОплаты</name>
    <type>
      <types>EnumRef.ЭтапыПроцессаОплатыСБП</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>КодСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>140</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>qrID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>qrUrl</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПлатежа</name>
    <type>
      <types>EnumRef.СтатусыПлатежаСБП</types>
    </type>
  </resources>
  <resources>
    <name>ДатаТранзакции</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторТранзакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>140</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/МПСтриж/src/InformationRegisters/ТранзакцииAssist/ТранзакцииAssist.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТранзакцииAssist</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>billnumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаТранзакции</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>merchant_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.Экспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипыОперацийAssist</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/МПСтриж/src/InformationRegisters/ИнформированиеЭкипажейОбИзмененияхВЗаказах/ИнформированиеЭкипажейОбИзмененияхВЗаказах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформированиеЭкипажейОбИзмененияхВЗаказах</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>СтароеЗначение</name>
    <type>
      <types>String</types>
      <types>Date</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НовоеЗначение</name>
    <type>
      <types>String</types>
      <types>Date</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнформацияПрочитана</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>EnumRef.РеквизитыЗаказа</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/МПСтриж/src/Enums/ТипЗаказа/ТипЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипЗаказа</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Забор</name>
  </enumValues>
  <enumValues>
    <name>Фрахт</name>
  </enumValues>
</mdclass:Enum>

EDT/МПСтриж/src/Enums/ВидыПодъемовВодителя/ВидыПодъемовВодителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПодъемовВодителя</name>
  <enumValues>
    <name>БезПодъема</name>
  </enumValues>
  <enumValues>
    <name>Лифт</name>
  </enumValues>
  <enumValues>
    <name>РучнойПодъем</name>
  </enumValues>
</mdclass:Enum>

EDT/МПСтриж/src/Enums/ТипыОперацийAssist/ТипыОперацийAssist.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОперацийAssist</name>
  <enumValues>
    <name>Оплата</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
</mdclass:Enum>

EDT/МПСтриж/src/Enums/РеквизитыЗаказа/РеквизитыЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РеквизитыЗаказа</name>
  <enumValues>
    <name>ДатаДоставки</name>
  </enumValues>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>СостояниеЗаказаОтменен</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаСвязьОтПолучателя</name>
  </enumValues>
</mdclass:Enum>

EDT/МПСтриж/src/Documents/ДанныеЗаказаВодителя/ДанныеЗаказаВодителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеЗаказаВодителя</name>
  <posting>Deny</posting>
  <attributes>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгруженВБД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказаВодитель</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыбранныйТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.РезультатыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодъема</name>
    <type>
      <types>EnumRef.ВидыПодъемовВодителя</types>
    </type>
  </attributes>
  <attributes>
    <name>Этаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Чек</name>
    <type>
      <types>DocumentRef.ЧекКПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторовЗапросаСостоянияЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиЧекаНаПечать</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПечатиЧеков</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправкиЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаФормированияЧекаНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратныйЧек</name>
    <type>
      <types>DocumentRef.ЧекКПечатиВозвратПрихода</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПодъемногоБрейка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПодъемаРассчитанная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПодъемаПодтвержденная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоХодокНаЭтаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТестоваяСреда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУстановленБезКИК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетнаяСтоимостьДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченаСтоимостьДоставкиПриОтменеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПредоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаЧерезAssist</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БылаПроизведенаПримерка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоSKUПримерки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратНаДоставку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоставленныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДоставлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоставщикТовара</name>
      <type>
        <types>CatalogRef.ПоставщикиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПредметаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/МПСтриж/src/Catalogs/ПоставщикиТоваров/ПоставщикиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоставщикиТоваров</name>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/МПСтриж/src/CommonModules/МодульОбмен_http/Module.bsl
Функция СформироватьСтрокуJSON(СтруктураJSON) Экспорт
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.Microsoft;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;		
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	//Попытка
		ЗаписатьJSON(ЗаписьJSON, СтруктураJSON, НастройкиСериализации);
	//Исключение
		
	//КонецПопытки;	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	Возврат СтрокаJSON;
КонецФункции

Функция ДанныеJSONВСтруктуру(ДанныеJSON, ИменаСвойствСоЗначениямиДата = "", ВозниклаОшибка = Ложь)
	Чт = Новый ЧтениеJSON;
	Чт.УстановитьСтроку(ДанныеJSON);
	Попытка
		СтруктураДанных = ПрочитатьJSON(Чт, Ложь, ИменаСвойствСоЗначениямиДата, ФорматДатыJSON.Microsoft);
	Исключение
		ВозниклаОшибка = Истина;
		Ош = ОписаниеОшибки();
		ОбщегоНазначения.ЗаписатьОшибкуВЛог(Ош + "-------" + ДанныеJSON);
	КонецПопытки;	
	Возврат СтруктураДанных;
КонецФункции


Функция ВызватьФункциюHTTPСервиса(СтрокаJSON, МетодHTTPСервиса, ОбщееСоединениеHTTP = "")
	ЗаголовокЗапроса = Новый Соответствие;
	ЗаголовокЗапроса.Вставить("Content-Type", "application/json");
	ЗаголовокЗапроса.Вставить("Authorization", "55555");
	
	
	Если Константы.ТестоваяСреда.Получить() Тогда
		СтрокаРесурса = "logist_copy_on_lem/hs/MARouteExchange/V1/" + МетодHTTPСервиса; 
	Иначе
		СтрокаРесурса = "logist/hs/MARouteExchange/V1/" + МетодHTTPСервиса; 
	КонецеСли;	
	
	HTTPЗапрос = Новый HTTPЗапрос(СтрокаРесурса, ЗаголовокЗапроса);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
	
	
	
	ЗапросПрошел = Ложь;
	
	Если Константы.ТестоваяСреда.Получить() Тогда
		Если ОбщееСоединениеHTTP = "" Тогда
			HTTPСоединение = Новый HTTPСоединение("192.168.5.104");
		Иначе
			HTTPСоединение = ОбщееСоединениеHTTP;
		конецЕсли;	
		
		Попытка
			Результат = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
			Если Результат.КодСостояния = 200 Тогда
				ОбщееСоединениеHTTP = HTTPСоединение;
				ЗапросПрошел = Истина;
			КонецЕсли;				
		исключение
			Ошибка = ОписаниеОшибки();
			ОбщегоНазначения.ЗаписатьОшибкуВЛог(Ошибка);
		КонецПопытки;			
	Иначе
		Если ОбщееСоединениеHTTP = "" Тогда
			Зап = Новый Запрос;
			Зап.Текст = "ВЫБРАТЬ
			|	МассивАдресовДляОбменаСМП.Адрес КАК Адрес
			|ИЗ
			|	РегистрСведений.МассивАдресовДляОбменаСМП КАК МассивАдресовДляОбменаСМП
			|ГДЕ
			|	МассивАдресовДляОбменаСМП.Терминал = &Терминал
			|
			|УПОРЯДОЧИТЬ ПО
			|	МассивАдресовДляОбменаСМП.Приоритет";
			Зап.УстановитьПараметр("Терминал", ПараметрыСеанса.Регион);
			ТабHTTPСоединений = Зап.Выполнить().Выгрузить();
			//ТабНТТPСоединений.Колонки.Добавить("HTTPСоединение");
			
			Для Каждого Тек Из ТабHTTPСоединений Цикл
				HTTPСоединение = Новый HTTPСоединение(Тек.Адрес,,,,,10);
				Попытка
					Результат = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
					Если Результат.КодСостояния = 200 Тогда
						ЗапросПрошел = Истина;
						ОбщееСоединениеHTTP = HTTPСоединение;	
						Прервать;
					КонецЕсли;	
				исключение
					Ошибка = ОписаниеОшибки() + ", метод " + МетодHTTPСервиса;
					ОбщегоНазначения.ЗаписатьОшибкуВЛог(Ошибка);
				КонецПопытки;	
			КонецЦикла;
		Иначе
			HTTPСоединение = ОбщееСоединениеHTTP;
			
			Попытка
				Результат = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
				Если Результат.КодСостояния = 200 Тогда
					ЗапросПрошел = Истина;
				КонецЕсли;	
			исключение
				Ошибка = ОписаниеОшибки() + ", метод " + МетодHTTPСервиса;
				ОбщегоНазначения.ЗаписатьОшибкуВЛог(Ошибка);
			КонецПопытки;	
			
		КонецЕсли;
	КонецеСли;
	
	если ЗапросПрошел Тогда
		ТекстОтвета = Результат.ПолучитьТелоКакСтроку("UTF-8");
	Иначе	
		ТекстОтвета = "";
	КонецеСли;	
	Возврат ТекстОтвета;
КонецФункции

Функция ВыгрузитьДанныеСтатусов(ОбщееСоединениеHTTP = "") Экспорт
	ЗапросДокументов = Новый Запрос;
	
	ЗапросДокументов.Текст = "ВЫБРАТЬ
	                         |	ДанныеЗаказаВодителя.Номер КАК numberDoc,
	                         |	ДанныеЗаказаВодителя.Дата КАК Date,
	                         |	ВЫБОР
	                         |		КОГДА ДанныеЗаказаВодителя.Реализация.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипЗаказа.Доставка)
	                         |			ТОГДА ДанныеЗаказаВодителя.Реализация.Номер
	                         |		ИНАЧЕ """"
	                         |	КОНЕЦ КАК orderId,
	                         |	ВЫБОР
	                         |		КОГДА ДанныеЗаказаВодителя.Реализация.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипЗаказа.Забор)
	                         |			ТОГДА ДанныеЗаказаВодителя.Реализация.Номер
	                         |		ИНАЧЕ """"
	                         |	КОНЕЦ КАК shipmentId,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.ПричинаОтказаПереноса.Код, """") КАК reasonRejectionId,
	                         |	ДанныеЗаказаВодителя.ДатаПереноса КАК DateReason,
	                         |	ДанныеЗаказаВодителя.СуммаНал КАК Summa,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.ВыбранныйТипОплаты.Код, """") КАК payTypeId,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.РезультатДоставки.Код, """") КАК ResultOfDelivery,
	                         |	ДанныеЗаказаВодителя.КоличествоМест КАК PiecesOfFreight,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.ОбъемныйБрейк.Код, """") КАК volumeBreakId,
	                         |	ДанныеЗаказаВодителя.КоличествоПалет КАК PaletCount,
	                         |	ВЫБОР
	                         |		КОГДА ДанныеЗаказаВодителя.ВидПодъема = ЗНАЧЕНИЕ(Перечисление.ВидыПодъемовВодителя.Лифт)
	                         |			ТОГДА 1
	                         |		КОГДА ДанныеЗаказаВодителя.ВидПодъема = ЗНАЧЕНИЕ(Перечисление.ВидыПодъемовВодителя.РучнойПодъем)
	                         |			ТОГДА 2
	                         |		КОГДА ДанныеЗаказаВодителя.ВидПодъема = ЗНАЧЕНИЕ(Перечисление.ВидыПодъемовВодителя.БезПодъема)
	                         |			ТОГДА 3
	                         |		ИНАЧЕ 0
	                         |	КОНЕЦ КАК TypeOfLifting,
	                         |	ДанныеЗаказаВодителя.Этаж КАК FloorOfLifting,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.Чек.ИдентификаторЧекаНаСервере, """") КАК idCheck,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.ТипОплаты.Код, """") КАК payTypeIdCheck,
	                         |	ДанныеЗаказаВодителя.КоличествоПовторовЗапросаСостоянияЧека КАК countRequestPrintingCheck,
	                         |	ДанныеЗаказаВодителя.ДатаОтправкиЧекаНаПечать КАК dateOfSendingDataOfCheck,
	                         |	ДанныеЗаказаВодителя.ДатаПечатиЧеков КАК dateOfPrintingCheck,
	                         |	ДанныеЗаказаВодителя.АдресОтправкиЧека КАК emailRecepient,
	                         |	ДанныеЗаказаВодителя.ОшибкаФормированияЧекаНаСервере КАК errorFormingCheck,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.ВозвратныйЧек.ИдентификаторЧекаНаСервере, """") КАК idReturnCheck,
	                         |	ДанныеЗаказаВодителя.КодПодъемногоБрейка КАК liftingBreakId,
	                         |	ДанныеЗаказаВодителя.ВесЗаказа КАК liftingWeight,
	                         |	ДанныеЗаказаВодителя.СтоимостьПодъемаРассчитанная КАК liftingCalcSum,
	                         |	ДанныеЗаказаВодителя.СтоимостьПодъемаПодтвержденная КАК liftingApprovedSum,
	                         |	ДанныеЗаказаВодителя.КоличествоХодокНаЭтаж КАК liftingCountOfWalkersPerFloor,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.Реализация.ВесЗаказа, """") КАК liftingWeightUploaded,
	                         |	ДанныеЗаказаВодителя.КодИдентификацииКлиента КАК customerIdentificationCode,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.Реализация.ИдентификаторРейса, """") КАК routeId,
	                         |	ДанныеЗаказаВодителя.СтатусУстановленБезКИК КАК statusSetWithoutCIC,
	                         |	ДанныеЗаказаВодителя.ОплаченаСтоимостьДоставкиПриОтменеЗаказа КАК CostDelivRequiredIfRefuse,
	                         |	ДанныеЗаказаВодителя.РасчетнаяСтоимостьДоставки КАК calculatedDeliveryCost,
	                         |	ДанныеЗаказаВодителя.СуммаДоставка КАК DeliveryCost,
	                         |	ДанныеЗаказаВодителя.ДоставленныеТовары.(
	                         |		ЕСТЬNULL(ДанныеЗаказаВодителя.ДоставленныеТовары.Номенклатура.Код, """") КАК goodsId,
	                         |		КоличествоДоставлено КАК count,
	                         |		ШтрихкодТовара КАК goodsBarcode,
	                         |		КодМаркировки КАК markingCode
	                         |	) КАК ДоставленныеТовары,
	                         |	ДанныеЗаказаВодителя.ВерсияКонфигурации КАК MetadataVersion,
	                         |	ДанныеЗаказаВодителя.ОплатаЧерезAssist КАК paymentThroughAssist,
	                         |	ЕСТЬNULL(ДанныеЗаказаВодителя.Организация.Код, """") КАК organization,
	                         |	ДанныеЗаказаВодителя.БылаПроизведенаПримерка КАК fittingHappened,
	                         |	ДанныеЗаказаВодителя.КоличествоSKUПримерки КАК countSKUForFitting,
	                         |	ДанныеЗаказаВодителя.ВозвратНаДоставку КАК returnToDelivery
	                         |ИЗ
	                         |	Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДанныеЗаказаВодителя.Изменения КАК ДанныеЗаказаВодителяИзменения
	                         |		ПО ДанныеЗаказаВодителя.Ссылка = ДанныеЗаказаВодителяИзменения.Ссылка
	                         |ГДЕ
	                         |	ДанныеЗаказаВодителяИзменения.Узел = &Узел
	                         |	И ДанныеЗаказаВодителя.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	ЗапросДокументов.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата() - 86400));
	ЗапросДокументов.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()));
	ЗапросДокументов.УстановитьПараметр("Узел", Константы.УзелПланаОбмена.Получить());
	
	РезультатПоСтатусам = ЗапросДокументов.Выполнить();
	ВыборкаСтатусов = РезультатПоСтатусам.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока ВыборкаСтатусов.Следующий() Цикл
		СтруктураДокумента = Новый Структура;
		Для каждого ТекКолонка Из РезультатПоСтатусам.Колонки Цикл
			Если ТекКолонка.Имя <> "ДоставленныеТовары" Тогда
				СтруктураДокумента.Вставить(ТекКолонка.Имя, ВыборкаСтатусов[ТекКолонка.Имя]);
			КонецеСли;
		КонецЦикла;	
		ВыборкаСтрок = ВыборкаСтатусов.ДоставленныеТовары.Выбрать();
		МассивСтрок = новый Массив;
		Пока ВыборкаСтрок.Следующий() Цикл
			СтруктураСтрокиДокумента = Новый Структура;
			СтруктураСтрокиДокумента.Вставить("goodsId", ВыборкаСтрок["goodsId"]);
			СтруктураСтрокиДокумента.Вставить("count", ВыборкаСтрок["count"]);
			СтруктураСтрокиДокумента.Вставить("markingCode", ВыборкаСтрок["markingCode"]);   
			СтруктураСтрокиДокумента.Вставить("goodsBarcode", ВыборкаСтрок["goodsBarcode"]);
			МассивСтрок.Добавить(СтруктураСтрокиДокумента);
		КонецЦикла;	
		СтруктураДокумента.Вставить("goods", МассивСтрок);
		МассивДокументов.Добавить(СтруктураДокумента);
	КонецЦикла;	
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("IDMA", Константы.ИдентификаторТелефона.Получить());   
	СтруктураЗапроса.Вставить("statuses", МассивДокументов);
	
	СтрокаЗапроса = СформироватьСтрокуJSON(СтруктураЗапроса);
	СтрокаОтвета = ВызватьФункциюHTTPСервиса(СтрокаЗапроса, "unloadStatusInfo", ОбщееСоединениеHTTP);
	
	Если ЗначениеЗаполнено(СтрокаОтвета) Тогда
		ВозниклаОшибка = Ложь;
		ДанныеОтвета = ДанныеJSONВСтруктуру(СтрокаОтвета, , ВозниклаОшибка);
		Если ВозниклаОшибка Тогда
			Возврат Ложь;
		КонецеСли;	
		Попытка
			Если ДанныеОтвета.result И Не ДанныеОтвета.error Тогда
				УдалитьРегистрацию_ДанныеЗаказаВодителя(ДанныеОтвета.numbers);
				Возврат Истина;
			ИначеЕсли ДанныеОтвета.error Тогда
				ОбщегоНазначения.ЗаписатьОшибкуВЛог(ДанныеОтвета.errorText);
				Возврат Ложь;
			КонецеСли;	
		исключение
			ОбщегоНазначения.ЗаписатьОшибкуВЛог(ОписаниеОшибки() + "-----" + СтрокаОтвета);
		КонецПопытки;
	Иначе	
		ОбщегоНазначения.ЗаписатьОшибкуВЛог("Не могу выгрузить статусы, http");
	КонецеСли;
КонецФункции	

Функция УдалитьРегистрацию_ДанныеЗаказаВодителя(МассивНомеров)
	Если Не ЗначениеЗаполнено(МассивНомеров) Тогда
		Возврат Истина;
	КонецеСли;	
	Зап = Новый запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ДанныеЗаказаВодителя.Ссылка КАК Объект
	            |ИЗ
	            |	Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	            |ГДЕ
	            |	ДанныеЗаказаВодителя.Номер В(&МассивНомеров)";
	Зап.УстановитьПараметр("МассивНомеров", МассивНомеров);
	Выб = Зап.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
    	ПланыОбмена.УдалитьРегистрациюИзменений(Константы.УзелПланаОбмена.Получить(), Выб.Объект);
	КонецЦикла;	
	Возврат Истина;
конецФункции	

Функция ВыполнитьОбмен_ПоставщикиТоваров(ОбщееСоединениеHTTP = "") Экспорт
	КодУзла = Константы.ИдентификаторТелефона.Получить();
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", КодУзла);
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	ДанныеПоставщиков = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getGoodsSellers", ОбщееСоединениеHTTP);
	
	
	СтруктураВызова = Новый Структура;
	
	ВозниклаОшибка = Ложь;
	Поставщики = ДанныеJSONВСтруктуру(ДанныеПоставщиков, , ВозниклаОшибка);
	Если ВозниклаОшибка Тогда
		Возврат Ложь;
	КонецеСли;	   
	
		
	ТаблицаРеквизитовПоставщиков = Новый ТаблицаЗначений;
	ТаблицаРеквизитовПоставщиков.Колонки.Добавить("Код",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(11)));
	ТаблицаРеквизитовПоставщиков.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТаблицаРеквизитовПоставщиков.Колонки.Добавить("ИНН",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(12)));
	ТаблицаРеквизитовПоставщиков.Колонки.Добавить("Телефон",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20)));	
		
	Для каждого Тек Из Поставщики Цикл
		НовСтрока = ТаблицаРеквизитовПоставщиков.Добавить();
		НовСтрока.Код = Тек.id;
		НовСтрока.Наименование = Тек.name;
		НовСтрока.ИНН = Тек.inn;
		НовСтрока.Телефон = Тек.phoneNumber;
	КонецЦикла;	
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ТЗПоставщики.Код КАК Код,
	            |	ТЗПоставщики.Наименование КАК Наименование,
	            |	ТЗПоставщики.Инн КАК Инн,
	            |	ТЗПоставщики.Телефон КАК Телефон
	            |ПОМЕСТИТЬ ТабПоставщиков
	            |ИЗ
	            |	&ТЗПоставщики КАК ТЗПоставщики
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ТабПоставщиков.Код КАК Код,
	            |	ТабПоставщиков.Наименование КАК Наименование,
	            |	ТабПоставщиков.Инн КАК Инн,
	            |	ТабПоставщиков.Телефон КАК Телефон,
	            |	ПоставщикиТоваров.Ссылка КАК Поставщик
	            |ИЗ
	            |	ТабПоставщиков КАК ТабПоставщиков
	            |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПоставщикиТоваров КАК ПоставщикиТоваров
	            |		ПО ТабПоставщиков.Код = ПоставщикиТоваров.Код";
	Зап.УстановитьПараметр("ТЗПоставщики", ТаблицаРеквизитовПоставщиков);
	ВыборкаПоставщиков = Зап.Выполнить().Выбрать();
	
	МассивКодов = Новый Массив;
	
	Пока ВыборкаПоставщиков.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаПоставщиков.Поставщик) Тогда
			Поставщик = ВыборкаПоставщиков.Поставщик.ПолучитьОбъект();
		Иначе
			Поставщик = Справочники.ПоставщикиТоваров.СоздатьЭлемент();
			Поставщик.Код = ВыборкаПоставщиков.Код;
		КонецеСли;
		
		
		Поставщик.Наименование = ВыборкаПоставщиков.Наименование;
		Поставщик.Инн = ВыборкаПоставщиков.Инн;
		Поставщик.Телефон = ВыборкаПоставщиков.Телефон;
		Поставщик.Записать();
		МассивКодов.Добавить(Поставщик.Код);
	конецЦикла;	
	
	Если МассивКодов.Количество() <> 0 Тогда
		СтруктураВызова.Вставить("ID", КодУзла);
		СтруктураВызова.Вставить("typeMetadata", "Справочник.ПоставщикиТоваров");
		СтруктураВызова.Вставить("numbers", МассивКодов);
		
		СтрокаЗапроса = СформироватьСтрокуJSON(СтруктураВызова);
		СтрокаОтвета = ВызватьФункциюHTTPСервиса(СтрокаЗапроса, "unregisterChanges", ОбщееСоединениеHTTP);
		ВозниклаОшибка = Ложь;
		ДанныеОтвета = ДанныеJSONВСтруктуру(СтрокаОтвета, , ВозниклаОшибка);
		Если ВозниклаОшибка Тогда
			Возврат Ложь;
		КонецеСли;			
		Если ДанныеОтвета.result И Не ДанныеОтвета.error Тогда
			Возврат Истина;
		ИначеЕсли ДанныеОтвета.error Тогда
			ОбщегоНазначения.ЗаписатьОшибкуВЛог(ДанныеОтвета.errorText);
			Возврат Ложь;
		КонецеСли;	
	Иначе
		Возврат Истина;
	КонецеСли;
КонецФункции	


Функция ВыполнитьОбмен_КалендариДоставок(ОбщееСоединениеHTTP = "") Экспорт
	КодУзла = Константы.ИдентификаторТелефона.Получить();
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", КодУзла);
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	ОтветМетода = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getDeliveryCalendars", ОбщееСоединениеHTTP);
	
	
	СтруктураВызова = Новый Структура;
	
	ВозниклаОшибка = Ложь;
	ОтветМетодаСтруктура = ДанныеJSONВСтруктуру(ОтветМетода, , ВозниклаОшибка);
	Если ВозниклаОшибка Тогда
		Возврат Ложь;
	КонецеСли;	   
	
	Если ОтветМетодаСтруктура.result.error Тогда
		ОбщегоНазначения.ЗаписатьОшибкуВЛог(ОтветМетодаСтруктура.errorText);
		Возврат Ложь;
	КонецеСли;	
		
	Календари = ОтветМетодаСтруктура.result.arrayOfCalendars;	
	Если Календари.Количество() = 0 Тогда
		Возврат Истина;
	КонецеСли;	
	
	МассивКодов = Новый Массив;
	
	Для Каждого ТекКалендарь Из Календари Цикл
		НайКалендарь = Справочники.КалендариДоставки.НайтиПоКоду(ТекКалендарь.id);
		Если НайКалендарь = Справочники.КалендариДоставки.ПустаяСсылка() Тогда
			Календарь = Справочники.КалендариДоставки.СоздатьЭлемент();
		Иначе
			Календарь = НайКалендарь.ПолучитьОбъект();
		КонецеСли;
		
		Календарь.Код = ТекКалендарь.id;
		Календарь.Наименование = ТекКалендарь.name;
		Календарь.ДнейСМоментаПоступления = ТекКалендарь.countOfDays;
		Календарь.ПометкаУдаления = ТекКалендарь.isDeleted;
		
		Календарь.ДниДоставки.Очистить();
		Для Каждого ТекДень Из ТекКалендарь.days Цикл
			НовДень = Календарь.ДниДоставки.Добавить();
			НовДень.ДеньНедели = ТекДень;
		КонецЦикла;	
		Календарь.Записать();
		МассивКодов.Добавить(Календарь.Код);
	КонецЦикла;	
	
	
	Если МассивКодов.Количество() <> 0 Тогда
		СтруктураВызова.Вставить("ID", КодУзла);
		СтруктураВызова.Вставить("typeMetadata", "Справочник.КалендариДоставки");
		СтруктураВызова.Вставить("numbers", МассивКодов);
		
		СтрокаЗапроса = СформироватьСтрокуJSON(СтруктураВызова);
		СтрокаОтвета = ВызватьФункциюHTTPСервиса(СтрокаЗапроса, "unregisterChanges", ОбщееСоединениеHTTP);
		ВозниклаОшибка = Ложь;
		ДанныеОтвета = ДанныеJSONВСтруктуру(СтрокаОтвета, , ВозниклаОшибка);
		Если ВозниклаОшибка Тогда
			Возврат Ложь;
		КонецеСли;			
		Если ДанныеОтвета.result И Не ДанныеОтвета.error Тогда
			Возврат Истина;
		ИначеЕсли ДанныеОтвета.error Тогда
			ОбщегоНазначения.ЗаписатьОшибкуВЛог(ДанныеОтвета.errorText);
			Возврат Ложь;
		КонецеСли;	
	Иначе
		Возврат Истина;
	КонецеСли;
КонецФункции	


Функция ВыполнитьОбмен_ВыгрузкаТранзакцийСБП(ОбщееСоединениеHTTP = "") Экспорт
	КодУзла = Константы.ИдентификаторТелефона.Получить();
	УзелПланаОбмена = Константы.УзелПланаОбмена.Получить();
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", КодУзла);
	
	МассивТранзакций = Новый Массив;
	ЗапросТранзакций = Новый Запрос;	
	ЗапросТранзакций.Текст = "ВЫБРАТЬ
	                         |	ТранзакцииСБП.Заказ.Номер КАК order,
	                         |	ТранзакцииСБП.ЭтапПроцессаОплаты КАК stagePaymentProcess,
	                         |	ТранзакцииСБП.Сумма КАК total,
	                         |	ЕСТЬNULL(ТранзакцииСБП.Организация.Код, """") КАК Organization,
	                         |	ТранзакцииСБП.КодСообщения КАК code,
	                         |	ТранзакцииСБП.qrID КАК qrID,
	                         |	ТранзакцииСБП.qrUrl КАК qrUrl,
	                         |	ТранзакцииСБП.СтатусПлатежа КАК paymentStatus,
	                         |	ТранзакцииСБП.ДатаТранзакции КАК transactionDate,
	                         |	ТранзакцииСБП.ИдентификаторТранзакции КАК transactionId,
	                         |	ТранзакцииСБП.Сообщение КАК message,
	                         |	ТранзакцииСБП.Период КАК period
	                         |ИЗ
	                         |	РегистрСведений.ТранзакцииСБП.Изменения КАК ТранзакцииСБПИзменения
	                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТранзакцииСБП КАК ТранзакцииСБП
	                         |		ПО ТранзакцииСБПИзменения.Период = ТранзакцииСБП.Период
	                         |			И ТранзакцииСБПИзменения.Заказ = ТранзакцииСБП.Заказ
	                         |ГДЕ
	                         |	ТранзакцииСБПИзменения.Узел = &Узел";
	ЗапросТранзакций.УстановитьПараметр("Узел", УзелПланаОбмена);
	РезультатЗапроса = ЗапросТранзакций.Выполнить();
	ВыборкаТранзакций = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаТранзакций.Следующий() Цикл
		СтруктураТранзакции = Новый Структура;
		Для каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
			Если ТекКолонка.Имя = "stagePaymentProcess" Тогда	
				Если ЗначениеЗаполнено(ВыборкаТранзакций.stagePaymentProcess) Тогда
					ИндексЗначенияПеречисления = Перечисления.ЭтапыПроцессаОплатыСБП.Индекс(ВыборкаТранзакций.stagePaymentProcess);
					СтруктураТранзакции.Вставить(ТекКолонка.Имя, Метаданные.Перечисления.ЭтапыПроцессаОплатыСБП.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя);
				Иначе
					СтруктураТранзакции.Вставить(ТекКолонка.Имя, "");
				КонецеСли;	
			ИначеЕсли ТекКолонка.Имя = "paymentStatus" Тогда	
				Если ЗначениеЗаполнено(ВыборкаТранзакций.paymentStatus) Тогда
					ИндексЗначенияПеречисления = Перечисления.СтатусыПлатежаСБП.Индекс(ВыборкаТранзакций.paymentStatus);
					СтруктураТранзакции.Вставить(ТекКолонка.Имя, Метаданные.Перечисления.СтатусыПлатежаСБП.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя);
				Иначе
					СтруктураТранзакции.Вставить(ТекКолонка.Имя, "");
				КонецеСли;
			//ИначеЕсли ТекКолонка.Имя = "order" Тогда	
			//	СтруктураТранзакции.Вставить(ТекКолонка.Имя, СокрЛП(ВыборкаТранзакций[ТекКолонка.Имя]));				
			Иначе	
				СтруктураТранзакции.Вставить(ТекКолонка.Имя, ВыборкаТранзакций[ТекКолонка.Имя]);
			КонецЕсли;	
		КонецЦикла;	
		МассивТранзакций.Добавить(СтруктураТранзакции);
	КонецЦикла;	
	СтруктураВызова.Вставить("arrayOfTransactionQPS", МассивТранзакций);
	Если МассивТранзакций.Количество() = 0 Тогда
		Возврат Истина;
	КонецеСли;	
	
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	ОтветВызоваJSON = ВызватьФункциюHTTPСервиса(СтрокаJSON, "loadTransactionsQPS", ОбщееСоединениеHTTP);
	ВозниклаОшибка = Ложь;
	ОтветВызова = ДанныеJSONВСтруктуру(ОтветВызоваJSON, , ВозниклаОшибка);
	Если ОтветВызова.result Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена.Ссылка, Метаданные.РегистрыСведений.ТранзакцииСБП);
	Иначе
		Возврат Ложь;
	КонецеСли;	
	Возврат Истина;
КонецФункции	


Функция ВыполнитьОбмен_ВыгрузкаТранзакцийAssist(ОбщееСоединениеHTTP = "") Экспорт
	КодУзла = Константы.ИдентификаторТелефона.Получить();
	УзелПланаОбмена = Константы.УзелПланаОбмена.Получить();
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", КодУзла);
	
	МассивТранзакций = Новый Массив;
	ЗапросТранзакций = Новый Запрос;	
	ЗапросТранзакций.Текст = "ВЫБРАТЬ
	                         |	ТранзакцииAssist.Заказ.Номер КАК order,
	                         |	ТранзакцииAssist.Сумма КАК total,
	                         |	ЕСТЬNULL(ТранзакцииAssist.Организация.Код, """") КАК Organization,
	                         |	ТранзакцииAssist.billnumber КАК billnumber,
	                         |	ТранзакцииAssist.Оплачен КАК payed,
	                         |	ТранзакцииAssist.ДатаТранзакции КАК transactionDate,
	                         |	ТранзакцииAssist.ТипОплаты.Код КАК PayType,
	                         |	ТранзакцииAssist.Рейс.НомерРейса КАК route,
	                         |	ЕСТЬNULL(ТранзакцииAssist.Водитель.Код, """") КАК driverId,
	                         |	ЕСТЬNULL(ТранзакцииAssist.Экспедитор.Код, """") КАК forwarderId,
	                         |	ТранзакцииAssist.merchant_id КАК merchant_id,
	                         |	ТранзакцииAssist.Период КАК period,
	                         |	ТранзакцииAssist.ТипОперации КАК OperationType
	                         |ИЗ
	                         |	РегистрСведений.ТранзакцииAssist.Изменения КАК ТранзакцииAssistИзменения
	                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТранзакцииAssist КАК ТранзакцииAssist
	                         |		ПО ТранзакцииAssistИзменения.Период = ТранзакцииAssist.Период
	                         |			И ТранзакцииAssistИзменения.Заказ = ТранзакцииAssist.Заказ
	                         |ГДЕ
	                         |	ТранзакцииAssistИзменения.Узел = &Узел";
	ЗапросТранзакций.УстановитьПараметр("Узел", УзелПланаОбмена);
	РезультатЗапроса = ЗапросТранзакций.Выполнить();
	ВыборкаТранзакций = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаТранзакций.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаТранзакций.PayType) Тогда
			Продолжить;
		КонецеСли;	
		СтруктураТранзакции = Новый Структура;
		Для каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
			Если ТекКолонка.Имя = "OperationType" Тогда	
				Если ЗначениеЗаполнено(ВыборкаТранзакций.OperationType) Тогда
					ИндексЗначенияПеречисления = Перечисления.ТипыОперацийAssist.Индекс(ВыборкаТранзакций.OperationType);
					СтруктураТранзакции.Вставить(ТекКолонка.Имя, Метаданные.Перечисления.ТипыОперацийAssist.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя);
				Иначе
					СтруктураТранзакции.Вставить(ТекКолонка.Имя, "");
				КонецеСли;	
			Иначе
				СтруктураТранзакции.Вставить(ТекКолонка.Имя, ВыборкаТранзакций[ТекКолонка.Имя]);
			КонецЕсли;	
		КонецЦикла;	
		МассивТранзакций.Добавить(СтруктураТранзакции);
	КонецЦикла;	
	СтруктураВызова.Вставить("arrayOfTransactionAssist", МассивТранзакций);
	Если МассивТранзакций.Количество() = 0 Тогда
		Возврат Истина;
	КонецеСли;	
	
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	ОтветВызоваJSON = ВызватьФункциюHTTPСервиса(СтрокаJSON, "loadTransactionsAssist", ОбщееСоединениеHTTP);
	ВозниклаОшибка = Ложь;
	ОтветВызова = ДанныеJSONВСтруктуру(ОтветВызоваJSON, , ВозниклаОшибка);
	Попытка
		Если ОтветВызова.result Тогда
			//спорное решение, но пока так
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена.Ссылка, Метаданные.РегистрыСведений.ТранзакцииAssist);
		Иначе
			Возврат Ложь;
		КонецеСли;	
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции	


Функция ВыполнитьОбмен_ДанныхИнформированияОИзмененияхВЗаказе(ОбщееСоединениеHTTP = "") Экспорт
	Рейс = ОбщегоНазначения.ПолучитьТекущийРейс();
	Если Не ЗначениеЗаполнено(Рейс) Тогда
		Возврат Истина;
	КонецЕсли;	
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("routeId", Рейс.НомерРейса);
	Транспорт = Константы.Транспорт.Получить().Код;
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	ДанныеИнформированияJSON = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getInformationChangesOrders", ОбщееСоединениеHTTP);
	
	
	ВозниклаОшибка = Ложь;
	ДанныеИнформирования = ДанныеJSONВСтруктуру(ДанныеИнформированияJSON, "period" , ВозниклаОшибка);
	Если ВозниклаОшибка Тогда
		Возврат Ложь;
	КонецеСли;	   
	
	
	Если Не ЗначениеЗаполнено(ДанныеИнформирования.arrayOfChangesOrders) Тогда
		Возврат Истина;
	КонецеСли;	
	
	ТаблицаИнформации = Новый ТаблицаЗначений;
	ТаблицаИнформации.Колонки.Добавить("НомерЗаказа",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(11)));
	ТаблицаИнформации.Колонки.Добавить("НаименованиеРеквизита", Новый ОписаниеТипов("ПеречислениеСсылка.РеквизитыЗаказа"));
	ТаблицаИнформации.Колонки.Добавить("СтароеЗначение",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));	
	ТаблицаИнформации.Колонки.Добавить("НовоеЗначение",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));	
	ТаблицаИнформации.Колонки.Добавить("ПериодЗаписи",Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	МассивДляОтправки = Новый Массив;
	
	Для Каждого Тек Из ДанныеИнформирования.arrayOfChangesOrders Цикл
		Нов = ТаблицаИнформации.Добавить();
		Нов.НомерЗаказа = Тек.order;
		Нов.НаименованиеРеквизита = Перечисления.РеквизитыЗаказа[Тек.property];
		Нов.СтароеЗначение = Тек.oldValue;
		Нов.НовоеЗначение = Тек.newValue;
		Нов.ПериодЗаписи = Тек.period;
		
		//Копирование данных для отправки
		КопияСтруктуры = Новый Структура;
		Для Каждого ЭлементСтруктуры Из Тек Цикл
			КопияСтруктуры.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
		КонецЦикла;
		КопияСтруктуры.Вставить("routeId", Рейс.НомерРейса);
		КопияСтруктуры.Вставить("carId", Транспорт);
		КопияСтруктуры.Вставить("period", ТекущаяДата());
		МассивДляОтправки.Добавить(КопияСтруктуры);
	КонецЦикла;	
	
	
	ЗапросМассивИнформации = Новый Запрос;
	ЗапросМассивИнформации.Текст = "ВЫБРАТЬ
	                         |	Таб.НомерЗаказа КАК НомерЗаказа,
	                         |	Таб.НаименованиеРеквизита КАК НаименованиеРеквизита,
	                         |	Таб.СтароеЗначение КАК СтароеЗначение,
	                         |	Таб.НовоеЗначение КАК НовоеЗначение,
							 |	Таб.ПериодЗаписи КАК ПериодЗаписи
	                         |ПОМЕСТИТЬ ВТ_Данные
	                         |ИЗ
	                         |	&Таб КАК Таб
	                         |;
	                         |
	                         |////////////////////////////////////////////////////////////////////////////////
	                         |ВЫБРАТЬ
	                         |	ВТ_Данные.НомерЗаказа КАК НомерЗаказа,
	                         |	ВТ_Данные.НаименованиеРеквизита КАК НаименованиеРеквизита,
	                         |	ВТ_Данные.СтароеЗначение КАК СтароеЗначение,
	                         |	ВТ_Данные.НовоеЗначение КАК НовоеЗначение,
							 |	ВТ_Данные.ПериодЗаписи КАК ПериодЗаписи,
	                         |	Заказ.Ссылка КАК Заказ
	                         |ИЗ
	                         |	ВТ_Данные КАК ВТ_Данные
	                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ КАК Заказ
	                         |		ПО ВТ_Данные.НомерЗаказа = Заказ.Номер";
	ЗапросМассивИнформации.УстановитьПараметр("Таб", ТаблицаИнформации);
	
	МассивИнформации = ЗапросМассивИнформации.Выполнить().Выбрать();
	
	//поиск причны отмены
	
	РезультатОтмены = "";
	РезультатПереноса = "";
	
	ЗапРезультаты = Новый Запрос;
	ЗапРезультаты.Текст = "ВЫБРАТЬ
	                      |	РезультатыДоставки.Ссылка КАК Отмена,
	                      |	"""" КАК Перенос
	                      |ИЗ
	                      |	Справочник.РезультатыДоставки КАК РезультатыДоставки
	                      |ГДЕ
	                      |	РезультатыДоставки.Отмена = ИСТИНА
	                      |	И РезультатыДоставки.Заезд = ЛОЖЬ
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ
	                      |	"""",
	                      |	РезультатыДоставки.Ссылка
	                      |ИЗ
	                      |	Справочник.РезультатыДоставки КАК РезультатыДоставки
	                      |ГДЕ
	                      |	РезультатыДоставки.Перенос = ИСТИНА
	                      |	И РезультатыДоставки.Заезд = ЛОЖЬ";
	ВыбРезультаты = ЗапРезультаты.Выполнить().Выбрать();
	Пока ВыбРезультаты.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыбРезультаты.Отмена) Тогда
			РезультатОтмены = ВыбРезультаты.Отмена;
		КонецеСли;	
			
		Если ЗначениеЗаполнено(ВыбРезультаты.Перенос) Тогда
			РезультатПереноса = ВыбРезультаты.Перенос;
		КонецеСли;	
	КонецЦикла;	
	
	Пока МассивИнформации.Следующий() Цикл
		Наб = РегистрыСведений.ИнформированиеЭкипажейОбИзмененияхВЗаказах.СоздатьНаборЗаписей();
		Наб.Отбор.Период.Установить(МассивИнформации.ПериодЗаписи);
		Наб.Отбор.Заказ.Установить(МассивИнформации.Заказ);
		Наб.Отбор.Реквизит.Установить(МассивИнформации.НаименованиеРеквизита);
		
		Нов = Наб.Добавить();
		Нов.Период = МассивИнформации.ПериодЗаписи;
		Нов.Заказ = МассивИнформации.Заказ;
		Нов.Реквизит = МассивИнформации.НаименованиеРеквизита;
		Нов.Рейс = Рейс;
		Если МассивИнформации.НаименованиеРеквизита = Перечисления.РеквизитыЗаказа.ДатаДоставки Тогда
			Нов.СтароеЗначение = Дата(МассивИнформации.СтароеЗначение);
			Нов.НовоеЗначение = Дата(МассивИнформации.НовоеЗначение);
		Иначе
			Нов.СтароеЗначение = МассивИнформации.СтароеЗначение;
			Нов.НовоеЗначение = МассивИнформации.НовоеЗначение;
		КонецеСли;
		
		Если МассивИнформации.НаименованиеРеквизита = Перечисления.РеквизитыЗаказа.ЗапросНаСвязьОтПолучателя Тогда
			Нов.НовоеЗначение = Дата(МассивИнформации.НовоеЗначение);
		КонецеСли;
		
		
		Наб.Записать();
		
		
		
		//переносим заказ в отклоненные или меняем дату доставки
		Заказ = МассивИнформации.Заказ.ПолучитьОбъект();
		Если МассивИнформации.НаименованиеРеквизита = Перечисления.РеквизитыЗаказа.СостояниеЗаказаОтменен Тогда
			Заказ.РезультатДоставки = РезультатОтмены;
			Заказ.Записать(РежимЗаписиДокумента.Запись);
			Документы.ДанныеЗаказаВодителя.ЭмуляцияВводаДанныхВодителемПоИнициативеПартнера(Заказ.Ссылка, РезультатОтмены);
		Конецесли;	
		
		Если МассивИнформации.НаименованиеРеквизита = Перечисления.РеквизитыЗаказа.ДатаДоставки Тогда
			Заказ.РезультатДоставки = РезультатПереноса;
			Заказ.Записать(РежимЗаписиДокумента.Запись);
			Документы.ДанныеЗаказаВодителя.ЭмуляцияВводаДанныхВодителемПоИнициативеПартнера(Заказ.Ссылка, РезультатОтмены, Дата(МассивИнформации.НовоеЗначение));
		Конецесли;	
	КонецЦикла;	
	
	Если МассивДляОтправки.Количество() <> 0 Тогда
		ОтветВызова = ВыполнитьОбмен_ДанныхИнформированияОИзмененияхВЗаказе_ОтМП(ОбщееСоединениеHTTP, "ИзменениеПереданоВМП", МассивДляОтправки);
	КонецЕсли;	
	
	Возврат Истина;
КонецФункции	


Функция ВыполнитьОбмен_ДанныхИнформированияОИзмененияхВЗаказе_ОтМП(ОбщееСоединениеHTTP = "", СтатусИнформирования, МассивИнформацииИзвне = Неопределено) Экспорт
	КодУзла = Константы.ИдентификаторТелефона.Получить();
	УзелПланаОбмена = Константы.УзелПланаОбмена.Получить();
	Транспорт = Константы.Транспорт.Получить().Код;
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", КодУзла);
	СтруктураВызова.Вставить("changeStatus", СтатусИнформирования);
	
	МассивИнформации = Новый Массив;
	ЗапросИнформации = Новый Запрос;
	Если СтатусИнформирования = "ИзменениеПереданоВМП" Тогда
		СтруктураВызова.Вставить("arrayOfChangesOrders", МассивИнформацииИзвне);
	ИначеЕсли СтатусИнформирования = "ИзменениеПросмотреноВМП" Тогда	
		ЗапросИнформации.Текст = "ВЫБРАТЬ
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказах.Заказ.Номер КАК order,
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказах.Период КАК period,
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказах.Реквизит КАК property,
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказах.Рейс.НомерРейса КАК routeID,
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказах.СтароеЗначение КАК oldValue,
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказах.НовоеЗначение КАК newValue
		                         |ИЗ
		                         |	РегистрСведений.ИнформированиеЭкипажейОбИзмененияхВЗаказах.Изменения КАК ИнформированиеЭкипажейОбИзмененияхВЗаказахИзменения
		                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнформированиеЭкипажейОбИзмененияхВЗаказах КАК ИнформированиеЭкипажейОбИзмененияхВЗаказах
		                         |		ПО ИнформированиеЭкипажейОбИзмененияхВЗаказахИзменения.Период = ИнформированиеЭкипажейОбИзмененияхВЗаказах.Период
		                         |			И ИнформированиеЭкипажейОбИзмененияхВЗаказахИзменения.Заказ = ИнформированиеЭкипажейОбИзмененияхВЗаказах.Заказ
		                         |			И ИнформированиеЭкипажейОбИзмененияхВЗаказахИзменения.Реквизит = ИнформированиеЭкипажейОбИзмененияхВЗаказах.Реквизит
		                         |ГДЕ
		                         |	ИнформированиеЭкипажейОбИзмененияхВЗаказахИзменения.Узел = &Узел";
		
		
		ЗапросИнформации.УстановитьПараметр("Узел", УзелПланаОбмена);
		РезультатЗапроса = ЗапросИнформации.Выполнить();
		ВыборкаИнформации = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаИнформации.Следующий() Цикл
			СтруктураИнформации = Новый Структура;
			Для каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
				Если ТекКолонка.Имя = "property" Тогда	
					Если ЗначениеЗаполнено(ВыборкаИнформации.property) Тогда
						ИндексЗначенияПеречисления = Перечисления.РеквизитыЗаказа.Индекс(ВыборкаИнформации.property);
						СтруктураИнформации.Вставить(ТекКолонка.Имя, Метаданные.Перечисления.РеквизитыЗаказа.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя);
					Иначе
						СтруктураИнформации.Вставить(ТекКолонка.Имя, "");
					КонецеСли;
				Иначе	
					СтруктураИнформации.Вставить(ТекКолонка.Имя, ВыборкаИнформации[ТекКолонка.Имя]);
				КонецЕсли;	
			КонецЦикла;	
			СтруктураИнформации.Вставить("carID", Транспорт);
			МассивИнформации.Добавить(СтруктураИнформации);
		КонецЦикла;	
		
		Если МассивИнформации.Количество() = 0 Тогда
			Возврат Истина;
		КонецеСли;	
			
		СтруктураВызова.Вставить("arrayOfChangesOrders", МассивИнформации);
	КонецеСли;

	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	ОтветВызоваJSON = ВызватьФункциюHTTPСервиса(СтрокаJSON, "setInformationChangesOrders", ОбщееСоединениеHTTP);
	ВозниклаОшибка = Ложь;
	ОтветВызова = ДанныеJSONВСтруктуру(ОтветВызоваJSON, , ВозниклаОшибка);
	Если ОтветВызова.result И СтатусИнформирования = "ИзменениеПросмотреноВМП" Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена.Ссылка, Метаданные.РегистрыСведений.ИнформированиеЭкипажейОбИзмененияхВЗаказах);
	ИначеЕсли СтатусИнформирования = "ИзменениеПереданоВМП" и ОтветВызова.result Тогда
		Возврат Истина;
	Иначе	
		Возврат Ложь;
	КонецеСли;	
	Возврат Истина;
КонецФункции	


Функция МаршрутизацияЯндекс_ПолучитьТекстЗапросаНаСервереПоРейсу(ОбщееСоединениеHTTP = "", НомерРейса, МассивСтруктурЗаказов = Неопределено) Экспорт
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("tripId", НомерРейса);
	Если МассивСтруктурЗаказов <> Неопределено Тогда
		СтруктураВызова.Вставить("orders", МассивСтруктурЗаказов);
	КонецеСли;	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getTextYandexRouting", ОбщееСоединениеHTTP);
	
	ОтветМетода = Новый Структура;
	
	ВозниклаОшибка = Ложь;
	ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
	Если ВозниклаОшибка Тогда
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	КонецеСли;	   
	
	
	Если Не ЗначениеЗаполнено(ДанныеВызова.textQuery) Тогда
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	Иначе
		ОтветМетода.Вставить("РезультатВызова", Истина);
		ОтветМетода.Вставить("ТекстЗапроса", ДанныеВызова.textQuery);
		Возврат ОтветМетода;
	КонецеСли;	
КонецФункции

Функция МаршрутизацияЯндекс_НачатьМаршрутизациюНаСервереПоРейсу(ОбщееСоединениеHTTP = "", НомерРейса, МассивСтруктурЗаказов = Неопределено, ДанныеТекущейТочки = Неопределено, ВыбранноеВремя, ДанныеФинальнойТочки = Неопределено, УчитыватьПорядок = Ложь) Экспорт
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("tripId", НомерРейса);
	Если МассивСтруктурЗаказов <> Неопределено Тогда
		СтруктураВызова.Вставить("orders", МассивСтруктурЗаказов);
	КонецеСли;	
	
	
	Если ВыбранноеВремя <> Неопределено Тогда
		СтруктураВызова.Вставить("startTime", ВыбранноеВремя);
	КонецеСли;	
	
	Если УчитыватьПорядок Тогда
		СтруктураВызова.Вставить("useRouteIndex", Истина);
	конецеСли;	
		
	Если ДанныеТекущейТочки <> Неопределено Тогда
		СтруктураВызова.Вставить("currentPoint", ДанныеТекущейТочки);
	КонецеСли;	
	
	Если ДанныеФинальнойТочки <> Неопределено Тогда
		//СтруктураВызова.Вставить("pointReturnAddress", Строка(ДанныеФинальнойТочки.Широта) + ";" + Строка(ДанныеФинальнойТочки.Долгота));
		СтруктураВызова.Вставить("pointReturnAddress", ДанныеФинальнойТочки);
	КонецеСли;	
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "putTaskYandexRouting", ОбщееСоединениеHTTP);
	
	ОтветМетода = Новый Структура;
	
	ВозниклаОшибка = Ложь;
	ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
	Если ВозниклаОшибка Тогда
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	КонецеСли;	   
	
	
	Если Не ЗначениеЗаполнено(ДанныеВызова.idQuery) Тогда
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	Иначе
		ОтветМетода.Вставить("РезультатВызова", Истина);
		ОтветМетода.Вставить("ИдЗапроса", ДанныеВызова.idQuery);
		Возврат ОтветМетода;
	КонецеСли;	
КонецФункции

Функция МаршрутизацияЯндекс_ПолучитьДанныеМаршрутизацииНаСервереПоРейсу(ОбщееСоединениеHTTP = "", идЗапроса, НомерРейса, Рейс = Неопределено) Экспорт
	СтруктураВызова = Новый Структура;   
	КодУзла = Константы.ИдентификаторТелефона.Получить();
	
	СтруктураВызова.Вставить("idQuery", идЗапроса);
	СтруктураВызова.Вставить("tripId", НомерРейса);
	СтруктураВызова.Вставить("ID", КодУзла);
	
	Если Рейс <> Неопределено Тогда
		ДанныеРейса = МаршрутизацияСервер.ПолучитьДопПараметрыРейсаЯМаршрутизации(Рейс);
		СтруктураВызова.Вставить("routeData", ДанныеРейса);
	КонецЕСли;	
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getResultTaskYandexRouting", ОбщееСоединениеHTTP);
	
	ОтветМетода = Новый Структура;
	
	ВозниклаОшибка = Ложь;
	
	//МассивЗначенийДат = Новый Массив;
	//МассивЗначенийДат.Добавить("timeOfArrival");         МассивЗначенийДат
	
	ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
	
	Если ВозниклаОшибка Тогда
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	КонецеСли;	   
	
	Если ДанныеВызова.Свойство("routing") Тогда
		Если Не ЗначениеЗаполнено(ДанныеВызова.routing) Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			Возврат ОтветМетода;
		Иначе
			ОтветМетода.Вставить("РезультатВызова", Истина);
			ОтветМетода.Вставить("ДанныеМаршрутизации", ДанныеВызова.routing);
			Возврат ОтветМетода;
		КонецеСли;	
	Иначе
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	КонецеСли;
КонецФункции


Функция РаспознатьАдрес(ОбщееСоединениеHTTP = "", Адрес) Экспорт
	СтруктураВызова = Новый Структура;   
	КодУзла = Константы.ИдентификаторТелефона.Получить();
	
	СтруктураВызова.Вставить("Address", Адрес);
	
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getAdressCoordinates", ОбщееСоединениеHTTP);
	
	ОтветМетода = Новый Структура;
	
	ВозниклаОшибка = Ложь;
	
	
	ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
	
	Если ВозниклаОшибка Тогда
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	КонецеСли;	   
	
	Если ДанныеВызова.Свойство("error") Тогда
		Если ДанныеВызова.error Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", ДанныеВызова.errorText);
			Возврат ОтветМетода;
		КонецеСли;
	КонецеСли;	
			
	
	
	Если ДанныеВызова.Свойство("location") Тогда
		ОтветМетода.Вставить("РезультатВызова", Истина);
		ОтветМетода.Вставить("Широта", ДанныеВызова.location.lat);
		ОтветМетода.Вставить("Долгота", ДанныеВызова.location.long);
		ОтветМетода.Вставить("РаспАдрес", ДанныеВызова.location.addressLocation);
		Возврат ОтветМетода;
	Иначе
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		Возврат ОтветМетода;
	КонецеСли;
КонецФункции

Функция ВыполнитьОбмен_ПолучитьСодержимоеСтраницыМаршрутизации(ОбщееСоединениеHTTP = "") Экспорт
	КодУзла = Константы.ИдентификаторТелефона.Получить();
	УзелПланаОбмена = Константы.УзелПланаОбмена.Получить();
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", КодУзла);
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	
	
	ОтветВызоваJSON = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getRouteMapBody", ОбщееСоединениеHTTP);
	ВозниклаОшибка = Ложь;
	ОтветВызова = ДанныеJSONВСтруктуру(ОтветВызоваJSON, , ВозниклаОшибка);
	Если Не ВозниклаОшибка Тогда
		Если Не ОтветВызова.isEmpty Тогда
			Константы.СодержимоеВерсииСтраницыМаршрутизации.Установить(ОтветВызова.routeMapBody);
			Константы.ВерсияСтраницыМаршрутизации.Установить(ОтветВызова.routeMapVersion);
		Иначе
			Возврат Ложь;
		КонецеСли;	
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецеСли;
	
КонецФункции

Функция Маршрутизация_ВыгрузитьДанныеРучнойМаршрутизации(ОбщееСоединениеHTTP = "", НомерРейса, Маршрут) Экспорт
	КодУзла = Константы.ИдентификаторТелефона.Получить();
	УзелПланаОбмена = Константы.УзелПланаОбмена.Получить();
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ID", КодУзла);
	СтруктураВызова.Вставить("tripID", НомерРейса);
	СтруктураВызова.Вставить("routing", Маршрут);
	СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
	
	
	ОтветВызоваJSON = ВызватьФункциюHTTPСервиса(СтрокаJSON, "unloadRoutingData", ОбщееСоединениеHTTP);
	ВозниклаОшибка = Ложь;
	ОтветВызова = ДанныеJSONВСтруктуру(ОтветВызоваJSON, , ВозниклаОшибка);
	Если Не ВозниклаОшибка Тогда
		Если Не ОтветВызова.error Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецеСли;	
	Иначе
		Возврат Ложь;
	КонецеСли;
	
КонецФункции

Функция ПолучитьКодДоступаКРММаршрутизации(ОбщееСоединениеHTTP = "", Рейс) Экспорт
	Попытка
		СтруктураВызова = Новый Структура;   
		КодУзла = Константы.ИдентификаторТелефона.Получить();
		
		СтруктураВызова.Вставить("regionId", СокрЛП(ПараметрыСеанса.Регион.Код));
		СтруктураВызова.Вставить("idRoute", СокрЛП(Рейс.НомерРейса));
		СтруктураВызова.Вставить("ID", СокрЛП(КодУзла));
		
		СтрокаJSON = СформироватьСтрокуJSON(СтруктураВызова);
		//
		//ОбщегоНазначения.ЗаписатьОшибкуВЛог(СтрокаJSON);
		//
		РезультатВызова = ВызватьФункциюHTTPСервиса(СтрокаJSON, "getAccessCodeRoutingWorkplace", ОбщееСоединениеHTTP);
		
		ОтветМетода = Новый Структура;
		
		ВозниклаОшибка = Ложь;
		
		
		ДанныеВызова = ДанныеJSONВСтруктуру(РезультатВызова, , ВозниклаОшибка);
		ДанныеВызова = ДанныеВызова.result;
		
		Если ВозниклаОшибка Тогда
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			ОтветМетода.Вставить("ОписаниеОшибки", "Возникла ошибка при запросе кода доступа!");
			Возврат ОтветМетода;
		КонецеСли;	   
		
		Если ДанныеВызова.Свойство("error") Тогда
			Если ДанныеВызова.error Тогда
				ОтветМетода.Вставить("РезультатВызова", Ложь);
				ОтветМетода.Вставить("ОписаниеОшибки", ДанныеВызова.errorText);
				Возврат ОтветМетода;
			КонецеСли;
		КонецеСли;	
		
		
		
		Если ДанныеВызова.Свойство("code") Тогда
			ОтветМетода.Вставить("РезультатВызова", Истина);
			ОтветМетода.Вставить("Код", ДанныеВызова.code);
			Возврат ОтветМетода;
		Иначе
			ОтветМетода.Вставить("РезультатВызова", Ложь);
			Возврат ОтветМетода;
		КонецеСли;
	Исключение
		ТОшибки = ОписаниеОшибки();
		ОбщегоНазначения.ЗаписатьОшибкуВЛог(ТОшибки);
		ОтветМетода.Вставить("РезультатВызова", Ложь);
		ОтветМетода.Вставить("ОписаниеОшибки", ТОшибки);
		Возврат ОтветМетода;
	КонецПопытки;
КонецФункции
